Revit 2027 API
ScheduleFieldId.InvalidScheduleFieldId Property
 Get the invalid ScheduleFieldId whose IntegerValue is -1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ScheduleFieldId InvalidScheduleFieldId { get; }
Public Shared ReadOnly Property InvalidScheduleFieldId As ScheduleFieldId
	Get
public:
static property ScheduleFieldId^ InvalidScheduleFieldId {
	ScheduleFieldId^ get ();
}
static member InvalidScheduleFieldId : ScheduleFieldId with get
Property Value
ScheduleFieldId
See Also
Reference
ScheduleFieldId Class
Autodesk.Revit.DB Namespace